tests/phpunit/fixtures/webhook-authorised.json

{
  "additionalData": {
    "fraudCheck-25-CVCAuthResultCheck": "1",
    "shopperCountry": "GB",
    "refusalReasonRaw": "AUTHORISED",
    "eci": "07",
    "threeDSVersion": "1.0.2",
    "acquirerAccountCode": "TestPmmAcquirerAccount",
    "fraudCheck-8-ShopperEmailUsage": "0",
    "fraudCheck-6-ShopperIpRefCheck": "0",
    "xid": "N/A",
    "threeDAuthenticated": "false",
    "fraudCheck-2-CardChunkUsage": "0",
    "threeDOffered": "true",
    "checkoutSessionId": "CS5F99915956700FF0",
    "fraudCheck-3-PaymentDetailUsage": "0",
    "threeDOfferedResponse": "N",
    "shopperEmail": "admin@example.com",
    "authorisationMid": "50",
    "checkout.cardAddedBrand": "visa",
    "fraudCheck-7-ShopperIpUsage": "0",
    "cavv": "N/A",
    "authorisedAmountCurrency": "EUR",
    "threeDAuthenticatedResponse": "N/A",
    "threeds2.cardEnrolled": "false",
    "avsResultRaw": "2",
    "retry.attempt1.rawResponse": "AUTHORISED",
    "paymentMethod": "visa",
    "fraudCheck-21-EmailDomainValidation": "0",
    "avsResult": "2 Neither postal code nor address match",
    "fraudCheck-41-PaymentDetailNonFraudRefCheck": "50",
    "cardSummary": "1142",
    "retry.attempt1.avsResultRaw": "2",
    "networkTxReference": "991412470445941",
    "shopperIP": "81.174.169.217",
    "totalFraudScore": "51",
    "hmacSignature": "l7wTVoKLsjlCzMT9s1JeLxy3eCexcWz7uFQ/fq6FCEA=",
    "expiryDate": "03/2030",
    "cavvAlgorithm": "N/A",
    "fraudCheck-26-ShopperEmailRefCheck": "0",
    "cardBin": "411111",
    "cvcResultRaw": "U",
    "fraudCheck-4-HolderNameUsage": "0",
    "merchantReference": "CiviCRM-test-20220809023627",
    "acquirerReference": "55846666868",
    "fraudCheck-13-IssuerRefCheck": "0",
    "fraudCheck-10-HolderNameContainsNumber": "0",
    "liabilityShift": "false",
    "fraudCheck-5-IPCountryReferral": "0",
    "authCode": "085479",
    "cardHolderName": "r lott",
    "PaymentAccountReference": "MNI6AU2garr2LpuaoP37v6KoThmTW",
    "retry.attempt1.acquirerAccount": "TestPmmAcquirerAccount",
    "retry.attempt1.acquirer": "TestPmmAcquirer",
    "authorisedAmountValue": "101",
    "fraudCheck-27-PmOwnerRefCheck": "0",
    "fraudCheck-11-HolderNameIsOneWord": "0",
    "issuerCountry": "unknown",
    "cvcResult": "5 Issuer not certified for CVC/CVV",
    "retry.attempt1.responseCode": "Approved",
    "fraudCheck-1-PaymentDetailRefCheck": "0",
    "retry.attempt1.shopperInteraction": "Ecommerce",
    "acquirerCode": "TestPmmAcquirer",
    "fraudCheck-28-AnonymousProxyCheck": "0"
  },
  "amount": {
    "currency": "EUR",
    "value": 101
  },
  "eventCode": "AUTHORISATION",
  "eventDate": "2022-08-09T16:36:59+02:00",
  "merchantAccountCode": "DummyAccount",
  "merchantReference": "civi-mock-ref-1",
  "operations": [
    "CANCEL",
    "CAPTURE",
    "REFUND"
  ],
  "paymentMethod": "visa",
  "pspReference": "TQ9J3F3J7G9WHD82",
  "reason": "085479:1142:03/2030",
  "success": "true"
}
